const surveyVars = {
    Q0Prompt: "סטטוס",
    Q0Ops: ["רווק.ה", "נשוי.ה", "בזוגיות", "גרוש.ה / פרוד.ה", "אלמנ.ה"],
  
    Q1Prompt: "השכלה:",
    Q1Ops: ["יסודית", "תיכונית (כולל תעודת בגרות)", "על-תיכונית/מקצועית", "תואר ראשון", "תואר שני ומעלה"],
  
    Q2Prompt: "מקום מגורים נוכחי",
    Q2Ops: ["מחוז צפון", "מחוז חיפה", "מחוז תל אביב", "מחוז מרכז", "מחוז ירושלים", "מחוז דרום"],
  
    Q3Prompt: "רמת דתיות",
    Q3Ops: ["אתאיסט.ית", "חילוני.ת", "מסורתי.ת", "דתי.ה לאומי.ת", "חרדי.ת"],
  
    Q4Prompt: "האם הנך מפונה מביתך בעקבות המלחמה?",
    Q4Ops: ["כן", "לא"],
  
    Q5Prompt: "מהי עמדתך הפוליטית ביחס לסכסוך, מדיניות חוץ וביטחון?",
    Q5Ops: ["ימין קיצוני", "ימין", "ימין מתון", "מרכז", "שמאל מתון", "שמאל", "שמאל קיצוני"],
  
    likertQ6Prompt: "<b style='font-size: 18px;'>.אני רואה את עצמי כחלק מהחברה הישראלית</b>",
    likertQ6Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ7Prompt: "<b style='font-size: 18px;'>.אני מרוצה להיות חלק מהחברה הישראלית</b>",
    likertQ7Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ8Prompt: "<b style='font-size: 18px;'>.אני מרגיש שיש לי קשרים חזקים עם ישראלים אחרים</b>",
    likertQ8Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ9Prompt: "<b style='font-size: 18px;'>.אני מזדהה עם ישראלים אחרים</b>",
    likertQ9Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ10Prompt: "<b style='font-size: 18px;'>.חשוב לי להיות חלק מהחברה הישראלית</b>",
    likertQ10Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ11Prompt: "<b style='font-size: 18px;'>.אני מרגיש בטוח במקומי בחברה הישראלית</b>",
    likertQ11Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ12Prompt: "<b style='font-size: 18px;'>.אני מרגיש דומה לישראלי הממוצע</b>",
    likertQ12Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ13Prompt: "<b style='font-size: 18px;'>.אני מרגיש חלק מהתרבות הישראלית</b>",
    likertQ13Labels: ["1", "2", "3", "4", "5", "6", "7"],
  
    likertQ14Prompt: "<b style='font-size: 18px;'>.אני מרגיש בנוח בחברת ישראלים אחרים</b>",
    likertQ14Labels: ["1", "2", "3", "4", "5", "6", "7"],

    sanityCheckQu: "<b style='font-size: 18px;'>.סמנו את המספר 6</b>",
    sanityCheckLabels: ["1", "2", "3", "4", "5", "6", "7"],
    }

export {surveyVars};