const ISR_M_NAMES = jsPsych.randomization.repeat(["נועם", "דוד", "אורי", "אריאל", "איתן", "יוסף", "איתי", "דניאל", "משה",
                    "איתמר", "עידו", "אברהם", "יאיר", "ינאי","עומרי", "אביתר", "נתן", "ליאור", "עידן",
                     "מתן", "אביב", "שחר", "אופיר", "אייל", "תומר", "יוחנן", "אופק", "דביר", "עוז", "ישראל",
                      "יהודה", "יעקב", "שמואל", "יצחק", "עילאי", "אלי", "חיים", "שמעון", "יהלי", "אור", "מאור",
                       "שי", "אלעד", "רון", "טל", "לביא", "יותם"]
                       ,1);
const ISR_F_NAMES = jsPsych.randomization.repeat(["יובל", "תמר", "מאיה", "אביגיל", "טליה", "אדל", "שירה", "איילה", "יעל", "שרה", "רוני", "רומי",
                        "חנה", "ליה", "מיכל", "אסתר", "נויה", "הודיה", "רבקה", "אלה", "נועה", "רחל", "אדוה", "חיה",
                         "אגם", "עלמא", "נעמי", "אריאל", "רות","תהל", "נגה", "הילה", "אמה", "עדי", "אפרת", "ליאן",
                          "גאיה", "מעיין", "אמילי", "יהלי", "עופרי", "שקד", "נטע", "מיקה", "הדס", "ליבי", "גילי",
                           "מיכאלה", "אלונה", "ליהי"]
                           ,1);

const ARAB_F_NAMES = jsPsych.randomization.repeat(
  ["איאת ايات", "אינס ايناس", "אמירה أميرة", "אסיל أسيل", "אסמא أسماء", "אראם ارام", "אריג' اريج", "ג'מילה جميلة", "ג'נא جنى", "דלאל دلال", "הודא هدى", "היבא هبة", "הנד هند", "וופא وفاء", "זינב زينب", "חיאת حياة", "חנאן حنان", "חנין حنين", "יארין يارين", "מרח مرح", "נאדיה نادية", "נאיה نايا", "נבאא نبأ", "נואל نوال", "נור نور", "סואר سوار", "סועאד سعاد", "סירין سيرين", "סלאם سلام", "סמירה سميرة", "עאישה عائشة", "עהד عهد", "פאטמה فاطمة", "ראניה رانيا", "רואן روان", "רזאן رزان", "רחיק رحيق", "רים ريم", "רימא ريما", "רינאד رناد", "רנים رنيم", "רנין رنين", "שדא شذا", "שהד شهد", "שמס شمس", "תאליה تاليا", "תאלין تالين"]
  ,1);

  const ARAB_M_NAMES =jsPsych.randomization.repeat([
    "אבראהים إبراهيم", "אחמד أحمد", "איאד اياد", "אמג'ד أمجد", "באסל باسل", "בשאר بشار", "ג'וד جود", 
    "ג'לאל جلال", "דאוד داوود", "האני هاني", "האשם هاشم", "סם سام", "זיאד زياد", "ח'אלד خالد", 
    "ח'ליל خليل", "חוסין حسين", "טלאל طلال", "יאסין ياسين", "יזיד يزيد", "כרים كريم", "מג'ד مجد", 
    "מוחמד محمد", "מג'ד مجد", "מוסא موسى", "מנסור منصور", "מרואן مروان", "סוהייב صهيب", "סמיר سمير", 
    "סעיד سعيد", "עבד عبد", "עימאד عماد", "ענאן عنان", "פאדי فادي", "פאוזי فوزي", 
    "פאיז فايز", "פריד فريد", "קאסם قاسم", "קוסאי قصي", "ראזי رازي", "ראיד رائد", "רדואן رضوان", 
    "רשיד رشيد", "שאדי شادي", "שריף شريف", "תאופיק توفيق", "תאמר تامر","عمر עומאר"
  ],1);
const namesByCond = [ISR_M_NAMES,ISR_F_NAMES,ARAB_M_NAMES,ARAB_F_NAMES];
export default namesByCond;